app/views/courses/index.html.erb

        <div class="card-action">
          <% if logged_in? && !(current_user.courses.include?(course)) %>
---
SELECT "courses".* FROM "courses"