app/controllers/students_controller.rb

INSERT INTO "students" ("name", "email", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?)
---
    def create
        #byebug
        @student = Student.new(student_params)
        if @student.save